src/main/java/ru/vk/itmo/test/kovalevigor/reports/html/stage3/cluster_16_stable_put_30000_wrk.txt
Running 5m test @ http://localhost:8080
  8 threads and 128 connections
  Thread calibration: mean lat.: 1.695ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.691ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.701ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.690ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.670ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.701ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.705ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.673ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.72ms    1.95ms  40.61ms   96.29%
    Req/Sec     3.95k   392.61    12.50k    80.76%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.40ms
 75.000%    1.90ms
 90.000%    2.43ms
 99.000%   10.30ms
 99.900%   27.82ms
 99.990%   34.62ms
 99.999%   37.47ms
100.000%   40.64ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.045     0.000000            1         1.00
       0.680     0.100000       873035         1.11
       0.883     0.200000      1743027         1.25
       1.056     0.300000      2613258         1.43
       1.224     0.400000      3482644         1.67
       1.396     0.500000      4353126         2.00
       1.485     0.550000      4783844         2.22
       1.579     0.600000      5220810         2.50
       1.678     0.650000      5656052         2.86
       1.785     0.700000      6089607         3.33
       1.905     0.750000      6526467         4.00
       1.971     0.775000      6742355         4.44
       2.043     0.800000      6959960         5.00
       2.121     0.825000      7177864         5.71
       2.207     0.850000      7394676         6.67
       2.307     0.875000      7612382         8.00
       2.365     0.887500      7720905         8.89
       2.431     0.900000      7828658        10.00
       2.511     0.912500      7937051        11.43
       2.613     0.925000      8045297        13.33
       2.757     0.937500      8154190        16.00
       2.861     0.943750      8208365        17.78
       3.011     0.950000      8262789        20.00
       3.223     0.956250      8317039        22.86
       3.629     0.962500      8371485        26.67
       4.671     0.968750      8425768        32.00
       5.295     0.971875      8453088        35.56
       5.939     0.975000      8480264        40.00
       6.631     0.978125      8507393        45.71
       7.399     0.981250      8534562        53.33
       8.287     0.984375      8561787        64.00
       8.783     0.985938      8575347        71.11
       9.319     0.987500      8588951        80.00
       9.903     0.989062      8602532        91.43
      10.575     0.990625      8616037       106.67
      11.399     0.992188      8629676       128.00
      11.879     0.992969      8636439       142.22
      12.439     0.993750      8643246       160.00
      13.111     0.994531      8650055       182.86
      13.951     0.995313      8656819       213.33
      15.199     0.996094      8663586       256.00
      16.143     0.996484      8666994       284.44
      17.407     0.996875      8670377       320.00
      19.023     0.997266      8673790       365.71
      20.863     0.997656      8677169       426.67
      22.815     0.998047      8680578       512.00
      23.759     0.998242      8682279       568.89
      24.703     0.998437      8683984       640.00
      25.679     0.998633      8685680       731.43
      26.799     0.998828      8687364       853.33
      27.967     0.999023      8689075      1024.00
      28.591     0.999121      8689910      1137.78
      29.199     0.999219      8690760      1280.00
      29.823     0.999316      8691611      1462.86
      30.463     0.999414      8692455      1706.67
      31.151     0.999512      8693309      2048.00
      31.503     0.999561      8693737      2275.56
      31.871     0.999609      8694165      2560.00
      32.223     0.999658      8694580      2925.71
      32.607     0.999707      8695016      3413.33
      33.023     0.999756      8695440      4096.00
      33.247     0.999780      8695657      4551.11
      33.471     0.999805      8695856      5120.00
      33.695     0.999829      8696068      5851.43
      33.983     0.999854      8696279      6826.67
      34.303     0.999878      8696490      8192.00
      34.495     0.999890      8696617      9102.22
      34.623     0.999902      8696700     10240.00
      34.815     0.999915      8696810     11702.86
      35.007     0.999927      8696914     13653.33
      35.231     0.999939      8697034     16384.00
      35.327     0.999945      8697079     18204.44
      35.423     0.999951      8697127     20480.00
      35.583     0.999957      8697181     23405.71
      35.775     0.999963      8697238     27306.67
      35.967     0.999969      8697286     32768.00
      36.095     0.999973      8697312     36408.89
      36.255     0.999976      8697338     40960.00
      36.575     0.999979      8697366     46811.43
      36.767     0.999982      8697391     54613.33
      36.927     0.999985      8697419     65536.00
      37.087     0.999986      8697430     72817.78
      37.247     0.999988      8697447     81920.00
      37.439     0.999989      8697458     93622.86
      37.567     0.999991      8697472    109226.67
      37.663     0.999992      8697483    131072.00
      37.791     0.999993      8697494    145635.56
      37.855     0.999994      8697498    163840.00
      37.887     0.999995      8697503    187245.71
      38.047     0.999995      8697512    218453.33
      38.143     0.999996      8697516    262144.00
      38.335     0.999997      8697520    291271.11
      38.431     0.999997      8697523    327680.00
      38.527     0.999997      8697526    374491.43
      38.687     0.999998      8697530    436906.67
      38.943     0.999998      8697534    524288.00
      39.007     0.999998      8697535    582542.22
      39.103     0.999998      8697536    655360.00
      39.423     0.999999      8697539    748982.86
      39.519     0.999999      8697540    873813.33
      39.583     0.999999      8697541   1048576.00
      39.711     0.999999      8697542   1165084.44
      39.775     0.999999      8697543   1310720.00
      39.839     0.999999      8697544   1497965.71
      39.935     0.999999      8697545   1747626.67
      39.935     1.000000      8697545   2097152.00
      40.255     1.000000      8697546   2330168.89
      40.255     1.000000      8697546   2621440.00
      40.575     1.000000      8697547   2995931.43
      40.575     1.000000      8697547   3495253.33
      40.575     1.000000      8697547   4194304.00
      40.607     1.000000      8697548   4660337.78
      40.607     1.000000      8697548   5242880.00
      40.607     1.000000      8697548   5991862.86
      40.607     1.000000      8697548   6990506.67
      40.607     1.000000      8697548   8388608.00
      40.639     1.000000      8697549   9320675.55
      40.639     1.000000      8697549          inf
#[Mean    =        1.716, StdDeviation   =        1.949]
#[Max     =       40.608, Total count    =      8697549]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  8998838 requests in 5.00m, 768.01MB read
Requests/sec:  29996.32
Transfer/sec:      2.56MB