src/main/java/ru/vk/itmo/test/kovalevigor/reports/html/stage3/cluster_4_get_40000_wrk.txt
Running 20s test @ http://localhost:8080
  8 threads and 128 connections
  Thread calibration: mean lat.: 1.888ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.894ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.882ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.881ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.879ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.884ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.873ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.873ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.97ms    2.26ms  19.90ms   90.55%
    Req/Sec     5.27k   718.39     9.11k    80.71%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.31ms
 75.000%    1.96ms
 90.000%    4.05ms
 99.000%   12.05ms
 99.900%   18.05ms
 99.990%   19.20ms
 99.999%   19.77ms
100.000%   19.92ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.056     0.000000            2         1.00
       0.526     0.100000        39789         1.11
       0.747     0.200000        79555         1.25
       0.939     0.300000       119217         1.43
       1.124     0.400000       158859         1.67
       1.312     0.500000       198438         2.00
       1.410     0.550000       218421         2.22
       1.511     0.600000       238148         2.50
       1.629     0.650000       258074         2.86
       1.773     0.700000       277823         3.33
       1.964     0.750000       297637         4.00
       2.095     0.775000       307646         4.44
       2.263     0.800000       317494         5.00
       2.511     0.825000       327454         5.71
       2.873     0.850000       337346         6.67
       3.375     0.875000       347244         8.00
       3.685     0.887500       352210         8.89
       4.055     0.900000       357182        10.00
       4.495     0.912500       362151        11.43
       5.063     0.925000       367099        13.33
       5.763     0.937500       372060        16.00
       6.159     0.943750       374550        17.78
       6.643     0.950000       377015        20.00
       7.203     0.956250       379497        22.86
       7.883     0.962500       381971        26.67
       8.599     0.968750       384450        32.00
       8.975     0.971875       385697        35.56
       9.367     0.975000       386928        40.00
       9.799     0.978125       388166        45.71
      10.263     0.981250       389415        53.33
      10.783     0.984375       390651        64.00
      11.095     0.985938       391275        71.11
      11.423     0.987500       391888        80.00
      11.783     0.989062       392516        91.43
      12.231     0.990625       393130       106.67
      12.815     0.992188       393746       128.00
      13.191     0.992969       394055       142.22
      13.599     0.993750       394367       160.00
      13.959     0.994531       394678       182.86
      14.367     0.995313       394989       213.33
      14.847     0.996094       395295       256.00
      15.199     0.996484       395450       284.44
      15.807     0.996875       395605       320.00
      16.415     0.997266       395761       365.71
      16.943     0.997656       395918       426.67
      17.295     0.998047       396075       512.00
      17.439     0.998242       396153       568.89
      17.583     0.998437       396234       640.00
      17.743     0.998633       396306       731.43
      17.887     0.998828       396385       853.33
      18.063     0.999023       396462      1024.00
      18.143     0.999121       396501      1137.78
      18.223     0.999219       396538      1280.00
      18.303     0.999316       396579      1462.86
      18.383     0.999414       396618      1706.67
      18.463     0.999512       396653      2048.00
      18.543     0.999561       396676      2275.56
      18.607     0.999609       396693      2560.00
      18.687     0.999658       396711      2925.71
      18.783     0.999707       396734      3413.33
      18.831     0.999756       396749      4096.00
      18.895     0.999780       396761      4551.11
      18.927     0.999805       396768      5120.00
      19.023     0.999829       396778      5851.43
      19.071     0.999854       396787      6826.67
      19.167     0.999878       396799      8192.00
      19.183     0.999890       396802      9102.22
      19.199     0.999902       396808     10240.00
      19.231     0.999915       396812     11702.86
      19.247     0.999927       396819     13653.33
      19.279     0.999939       396821     16384.00
      19.343     0.999945       396826     18204.44
      19.343     0.999951       396826     20480.00
      19.391     0.999957       396829     23405.71
      19.439     0.999963       396831     27306.67
      19.535     0.999969       396833     32768.00
      19.551     0.999973       396835     36408.89
      19.599     0.999976       396836     40960.00
      19.679     0.999979       396837     46811.43
      19.727     0.999982       396839     54613.33
      19.727     0.999985       396839     65536.00
      19.759     0.999986       396840     72817.78
      19.775     0.999988       396841     81920.00
      19.775     0.999989       396841     93622.86
      19.823     0.999991       396842    109226.67
      19.823     0.999992       396842    131072.00
      19.871     0.999993       396843    145635.56
      19.871     0.999994       396843    163840.00
      19.871     0.999995       396843    187245.71
      19.887     0.999995       396844    218453.33
      19.887     0.999996       396844    262144.00
      19.887     0.999997       396844    291271.11
      19.887     0.999997       396844    327680.00
      19.887     0.999997       396844    374491.43
      19.919     0.999998       396845    436906.67
      19.919     1.000000       396845          inf
#[Mean    =        1.971, StdDeviation   =        2.260]
#[Max     =       19.904, Total count    =       396845]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  798482 requests in 20.00s, 166.82MB read
  Non-2xx or 3xx responses: 362022
Requests/sec:  39924.79
Transfer/sec:      8.34MB
------------------------------

HTTP Status 404 Count: 362022
HTTP Status 503 Count: 0